{
    "description": "Log Min Messages Database Flag For PostgreSQL Instance Is Not Set",
    "rationale": "Auditing helps in troubleshooting operational problems and also permits forensic analysis. If log_min_error_statement is not set to the correct value, messages may not be classified as error messages appropriately. Considering general log messages as error messages would make it difficult to find actual errors, while considering only stricter severity levels as error messages may skip actual errors to log their SQL statements. The log_min_error_statement flag should be set in accordance with the organization's logging policy. This recommendation is applicable to PostgreSQL database instances.",
    "remediation": "From console:<ol><li>Go to the Cloud SQL Instances page in the Google Cloud Console by visiting https://console.cloud.google.com/sql/instances.</li><li>Select the PostgreSQL instance where the database flag needs to be enabled.</li><li>Click <samp>Edit</samp></li><li>Scroll down to the <samp>Flags</samp> section.</li><li>To set a flag that has not been set on the instance before, click <samp>Add item</samp>, choose the flag <samp>log_min_error_statement</samp> from the drop-down menu, and set appropriate value.</li><li>Click <samp>Save</samp></li><li>Confirm the changes under <samp>Flags</samp> on the Overview page.</li></ol>",
    "compliance": [
        {
            "name": "CIS Google Cloud Platform Foundations",
            "version": "1.1.0",
            "reference": "6.2.5"
        }
    ],
    "references": [
        "https://www.postgresql.org/docs/9.6/runtime-config-logging.html#RUNTIME-CONFIG-LOGGING-WHEN",
        "https://cloud.google.com/sql/docs/postgres/flags"
    ],
    "dashboard_name": "Instances",
    "path": "cloudsql.projects.id.instances.id",
    "conditions": [
        "and",
        [
            "cloudsql.projects.id.instances.id.log_min_messages",
            "false",
            ""
        ]
    ],
    "id_suffix": "log_min_messages"
}